# YOLOv5 ? by Ultralytics, AGPL-3.0 license

# Parameters
nc: 6  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]], #2
   [-1, 1, CoordAtt, [128]], #3                CA

   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]], #4   5
   [-1, 1, CoordAtt, [256]],#6

   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],   #6   8
   [-1, 1, CoordAtt, [512]],#9

   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, CTR3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9  12
  ]


# YOLOv5 v6.0 head
head:
  [[[3, 6, 9, 12], 1, SimFusion_4in, []], # 10  13
   [-1, 1, IFM, [[64, 32]]], # 11    14

   [12, 1, Conv, [512, 1, 1]], # 12   15
   [[6, 9, -1], 1, SimFusion_3in, [512]], # 13   16
   [[-1, 14], 1, InjectionMultiSum_Auto_pool, [512, [64, 32], 0]], # 14   17
   [-1, 3, CTR3, [512, False]], # 15   18

   [9, 1, Conv, [256, 1, 1]], # 16   19
   [[3, 6, -1], 1, SimFusion_3in, [256]], # 17    20
   [[-1, 14], 1, InjectionMultiSum_Auto_pool, [256, [64, 32], 1]], # 18    21
   [-1, 3, C3, [256, False]], # 19    22

   [[22, 18, 12], 1, PyramidPoolAgg, [352, 2]], # 20    23
   [-1, 1, TopBasicLayer, [352, [64, 128]]], # 21    24

   [[22, 19], 1, AdvPoolFusion, []], # 22    25
   [[-1, 24], 1, InjectionMultiSum_Auto_pool, [256, [64, 128], 0]], # 23    26
   [-1, 3, C3, [256, False]], # 24    27

   [[-1, 15], 1, AdvPoolFusion, []], # 25    28
   [[-1, 24], 1, InjectionMultiSum_Auto_pool, [512, [64, 128], 1]], # 26    29
   [-1, 3, C3, [512, False]], # 27    30

   [[22, 27, 30], 1, Detect, [nc, anchors]] # 28    31
  ]